_org/_posts/dev/2018-09-13-ruby.org
+begin_export html
---
layout: post
title: "Ruby 学习"
date: 2018-09-13
categories: 程序设计
tags:
    - Ruby
---
#+end_export

* 数据类型

** 字符串 String

** 字符串拼接

- 可以使用字符串插值 ="#{a} and #{b}"= 或 =String#concat= 或 =<<=、=+=
  运算符。
- 如果不确定变量是否为 =nil=，推荐使用插值的形式，其他方法如果有 =nil=
  值，会报异常。
- 如果明确异常可控，推荐使用 =concat=， =+==
  方法是先复制原字符串后，在复制本字符串尾部追加。
  这种方法会吃掉大量的内存。 而 concat 方法是直接在原字符串尾部追加。

** 符号 Symbol

- 符号可以简单看作没有约束的字符串，符号是整体的，比较的时候只比较一次，不像字符串需要每个字符去比较。
- 符号的命名一般是字母、下划线、数字，数字不能用于首位。

#+BEGIN_EXAMPLE
    symb = :symbol
#+END_EXAMPLE

** 数组 Array

#+BEGIN_EXAMPLE
    arr = [0, 1, 2]
    chs = %w[a b c]
#+END_EXAMPLE

- 数组的索引可以是负数，=-1= 是最后一个数组项。
- =%w= 用于创建元素为字符串的数组。

** 值域 Range

#+BEGIN_EXAMPLE
    val = 0..3
    arr = ('a'..'g').to_a
    av = arr[val]
#+END_EXAMPLE

** 散列 Hash

- 散列（Hash）本质上就是数组，只不过它的索引不局限于只能使用数字。三列的索引几乎可以使用任何对象，一般我们称之为"键值"。
- 调用方法时，如果散列是最后一个参数，可以省略花括号。

#+BEGIN_EXAMPLE
    # 空散列
    user = { }
    # 键为 ":first_name"，值为 "Michael"
    user[:first_name] = 'Michael'

    # 散列的定义
    ha = { 'name' => 'Bob', 'age' => 33 }
    # 符号做键值的时候散列的定义可以使用简洁的语法
    hasym = { name: 'Bob', age: 33}

    # 散列迭代
    hasym.each do |key, value|
      puts "Key #{key.inspect} has value #{value.inspect}"
    end
#+END_EXAMPLE

** 块

#+BEGIN_EXAMPLE
    (1..5).each { |i| puts 2 * i }

    (1..5).each do |i|
      puts 2 * i
    end
#+END_EXAMPLE

** 类

** 具名构造方法

#+BEGIN_EXAMPLE
    Object.new
    String.new
    Array.new
    Range.new(m, n)
    Hash.new
#+END_EXAMPLE

** 类的初始化

#+BEGIN_EXAMPLE
    class User
      attr_accessor :name, :age

      def initialize(args = {})
        @name = args[:name]
        @age  = args[:age]
      end
    end
#+END_EXAMPLE

** 类的继承

- Ruby 的类继承：=String->Object->BasicObject=。
- 类定义里，self 代表的是对象本身。

#+BEGIN_EXAMPLE
    class MyClass < Object
    end
#+END_EXAMPLE

** 修改类

#+BEGIN_EXAMPLE
    class String
      # 回文字符串返回 true
      def palindrome?
        self == self.reverse
      end
    end
#+END_EXAMPLE

* 伪变量

伪变量是特殊的变量，有着局部变量的外观，但行为却像常量。您不能给这些变量赋任何值。

- self : 当前方法的接收器对象。
- true : 代表 true 的值。
- false: 代表 false 的值。
- nil : 代表 undefined 的值。
- *FILE*: 当前源文件的名称。
- *LINE*: 当前行在源文件中的编号。

* 变量作用域

- 常量
  ：以大写字母开头。定义在类或模块内的常量可以从类或模块的内部访问，定义在类或模块外的常量可以被全局访问。常量不能定义在方法内。引用一个未初始化的常量会产生错误。对已经初始化的常量赋值会产生警告。在外部引用常量名需要使用
  =::=。
- 全局变量：以 =$= 为前缀，对整个程序可见。未初始化的值为 =nil=，在使用
  =-w= 选项后，会产生警告。
- 类变量 ：以 =@@=
  为前缀，仅对定义该类变量的类及其子类可见。必须初始化后才能在方法定义中使用。在使用
  =-w= 选项后，重载类变量会产生警告。
- 实例变量：以 =@=
  为前缀，对定义该变量的类的实例及其实例方法可见，但不可以直接被类使用。未初始化的值为
  =nil=，在使用 =-w= 选项后，会产生警告。
- 局部变量：仅在局部代码块中可见，局部变量的作用域从
  =class=、=module=、=def= 或 =do=
  到相对应的结尾或者从左大括号到右大括号。当调用一个未初始化的局部变量时，它被解释为调用一个不带参数的方法。

* module and class

1. module
   比较关注的是功能方面，它把方法收集在一起，组成一个特殊的上下文，通常表示一种能力，比如
   Enumerable。
2. class
   就是我们所理解的经典的类，它可以创建实例对象，包含实例变量和类变量，一般通过对象来与外界交流。

class 和 module 很相似，类只不过是增加强了 module，它比 module
多了三个方法：new()、allocate()和 superclass()。

class 扩展 module 时用的两种方法：include 和
extend，当然它们是有区别的。

- include 包含一个 module 时，把它的实例方法和变量变成了 class
  的实例方法和变量，这样类的祖先链中会出现这个 module。
- extend 扩展一个 module 时，会把它的实例方法作为类方法加入到
  class，并且祖先链里不会出现这个 module。
- 可以通过 =extend self=
  的方式暴露本模块的实例方，多混合时慎用。还可以通过匿名形式
  =extend Module.new { def hello; 'hello'; end}= 的形式处理，避免
  =include= 后的污染。
- module 中定义的静态方法只能通过模块名引用，通过 =extend self=
  暴露的可以被类 =extend=、=include=。
- 通过 =extend=、=include= 引用的模块，不能嵌套引用。
- 通过 =extend= 引用的多个模块，数据独立，相互之间不能互通。
- 通过 =A::B= 的形式定义模块时，左边的 =A= 需要提前定义。

所有的类都继承自 object 类，object 类又继承 basicobject 类，basicobject
它是一个白板类。object 类是 ruby
类和对象默认的根类，它的方法在所有子类中可用，它包含了 kernel 内核。

class 通常都是逻辑完整的，甚至能在现实世界中找到对应物，而对 module
来说却很难是逻辑完整的，因为 module
只能描述一个特殊的上下文，而这个上下文通常无法组成一个完整的对象，需要被找一个宿主，而这个宿主有可能是
class，也有可能是 module。

需要用于做命名空间或用于 mixin 的时候用 module, 其他时候用 class。 当
class 中或多个 class 中有重复代码需要抽象出来时，可以使用 module。

更容易解耦，继承哪个类，只能选一个，但具体要 include 哪几个 module
可以根据不同需求选择不同的 module. 有了 autoload 更加能优化性能。
可以考虑先用 class 去写代码， 当多个 class 的代码逻辑相似的时候，
可以考虑用基类/继承来提取相似的逻辑。当继承无法实现提取的时候，
比如有时候，两个 class 代码逻辑相似， 但是，两个 class 的基类不同，而
ruby 又不支持多继承。 所以，这个时候， 就可以考虑使用 module
来实现，相似代码的提取。

* 单例 singleton

instance 方法定义在 Singleton
这个模块里，运行时将这个模块引入，类就可以访问 Singleton 中的 instance
方法。

#+BEGIN_SRC ruby
    require 'singleton'
    class Logger
      include Singleton

    end
#+END_SRC

* =self= 说明

- =self= 在 =class= 内, 代表当前类。
- =self= 在 =class << self= 内,
  代表当前类，此范围内定义为类方法和类变量。
- =self= 在 =def self.class_method= 内, 代表当前类。
- =self= 在 =def instance_method= 内, 代表当前类的实例。
- =extend self= 在 =module= 内, 模块方法不能直接调用，通过 =extend self=
  让实例方法同时为类方法，可以直接使用模块方法，如果被 =include= 到
  =class= 中，依然还是类的实例方法。

** =self= 和 =@= 使用区别

- 通过 =attr_accessor :val= 定义实例变量，会创建实例变量
  =val=，并在构造函数中对它初始化，同时创建读方法 =val= 和写方法 =val==
  的变量访问器。外部可以直接通过实例对象的变量访问器来访问变量。在类的方法内访问可以使用
  =@val= 访问，也可以使用 =self.val= 访问实例方法。
- 通过 =@=
  定义实例变量，外部不能直接访问，只能通过定义的方法访问。在类的方法内访问需要加
  =@= 符号。
- 类的实例变量不一定先要在构造函数中定义和初始化。
  可以在类的任意方法中定义和使用，使用前也不需要初始化。

** 注意

- 左值不要省略 =self= 或 =@=。
- =self.=
  前缀默认调用方法。没有前缀的同名的变量会以较高的优先级覆盖掉同名的方法，可以通过在方法调用时显式添加括号或者在调用方法前显式添加
  =self= 作为方法接收对象。

* 方法

- 方法后缀感叹号，表示会修改对象的值。

** 方法参数

