_posts/dev/2018-09-13-ruby.html
<p>
+begin_export html
&#x2014;
layout: post
title: "Ruby 学习"
date: 2018-09-13
categories: 程序设计
tags:
</p>
<ul class="org-ul">
<li>Ruby</li>
</ul>
<p>
&#x2014;
#+end_export
</p>

<div id="outline-container-org458cb89" class="outline-2">
<h2 id="org458cb89"><span class="section-number-2">1</span> 数据类型</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc5a95f2" class="outline-3">
<h3 id="orgc5a95f2"><span class="section-number-3">1.1</span> 字符串 String</h3>
</div>

<div id="outline-container-org5e2b6b1" class="outline-3">
<h3 id="org5e2b6b1"><span class="section-number-3">1.2</span> 字符串拼接</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>可以使用字符串插值 <code>"#{a} and #{b}"</code> 或 <code>String#concat</code> 或 <code>&lt;&lt;=、=+</code>
运算符。</li>
<li>如果不确定变量是否为 <code>nil=，推荐使用插值的形式，其他方法如果有 =nil</code>
值，会报异常。</li>
<li>如果明确异常可控，推荐使用 <code>concat=， =+=</code>
方法是先复制原字符串后，在复制本字符串尾部追加。
这种方法会吃掉大量的内存。 而 concat 方法是直接在原字符串尾部追加。</li>
</ul>
</div>
</div>

<div id="outline-container-orgaf81e3e" class="outline-3">
<h3 id="orgaf81e3e"><span class="section-number-3">1.3</span> 符号 Symbol</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>符号可以简单看作没有约束的字符串，符号是整体的，比较的时候只比较一次，不像字符串需要每个字符去比较。</li>
<li>符号的命名一般是字母、下划线、数字，数字不能用于首位。</li>
</ul>

<pre class="example">
symb = :symbol
</pre>
</div>
</div>

<div id="outline-container-org10c7494" class="outline-3">
<h3 id="org10c7494"><span class="section-number-3">1.4</span> 数组 Array</h3>
<div class="outline-text-3" id="text-1-4">
<pre class="example">
arr = [0, 1, 2]
chs = %w[a b c]
</pre>

<ul class="org-ul">
<li>数组的索引可以是负数，=-1= 是最后一个数组项。</li>
<li><code>%w</code> 用于创建元素为字符串的数组。</li>
</ul>
</div>
</div>

<div id="outline-container-org40ff753" class="outline-3">
<h3 id="org40ff753"><span class="section-number-3">1.5</span> 值域 Range</h3>
<div class="outline-text-3" id="text-1-5">
<pre class="example">
val = 0..3
arr = ('a'..'g').to_a
av = arr[val]
</pre>
</div>
</div>

<div id="outline-container-orgaab16d0" class="outline-3">
<h3 id="orgaab16d0"><span class="section-number-3">1.6</span> 散列 Hash</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>散列（Hash）本质上就是数组，只不过它的索引不局限于只能使用数字。三列的索引几乎可以使用任何对象，一般我们称之为"键值"。</li>
<li>调用方法时，如果散列是最后一个参数，可以省略花括号。</li>
</ul>

<pre class="example">
# 空散列
user = { }
# 键为 ":first_name"，值为 "Michael"
user[:first_name] = 'Michael'

# 散列的定义
ha = { 'name' =&gt; 'Bob', 'age' =&gt; 33 }
# 符号做键值的时候散列的定义可以使用简洁的语法
hasym = { name: 'Bob', age: 33}

# 散列迭代
hasym.each do |key, value|
  puts "Key #{key.inspect} has value #{value.inspect}"
end
</pre>
</div>
</div>

<div id="outline-container-orgc0c28ff" class="outline-3">
<h3 id="orgc0c28ff"><span class="section-number-3">1.7</span> 块</h3>
<div class="outline-text-3" id="text-1-7">
<pre class="example">
(1..5).each { |i| puts 2 * i }

(1..5).each do |i|
  puts 2 * i
end
</pre>
</div>
</div>

<div id="outline-container-org2d55ff9" class="outline-3">
<h3 id="org2d55ff9"><span class="section-number-3">1.8</span> 类</h3>
</div>

<div id="outline-container-orgffc311f" class="outline-3">
<h3 id="orgffc311f"><span class="section-number-3">1.9</span> 具名构造方法</h3>
<div class="outline-text-3" id="text-1-9">
<pre class="example">
Object.new
String.new
Array.new
Range.new(m, n)
Hash.new
</pre>
</div>
</div>

<div id="outline-container-org4c3dafc" class="outline-3">
<h3 id="org4c3dafc"><span class="section-number-3">1.10</span> 类的初始化</h3>
<div class="outline-text-3" id="text-1-10">
<pre class="example">
class User
  attr_accessor :name, :age

  def initialize(args = {})
    @name = args[:name]
    @age  = args[:age]
  end
end
</pre>
</div>
</div>

<div id="outline-container-orgafaea32" class="outline-3">
<h3 id="orgafaea32"><span class="section-number-3">1.11</span> 类的继承</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>Ruby 的类继承：=String-&gt;Object-&gt;BasicObject=。</li>
<li>类定义里，self 代表的是对象本身。</li>
</ul>

<pre class="example">
class MyClass &lt; Object
end
</pre>
</div>
</div>

<div id="outline-container-org2dc6bd9" class="outline-3">
<h3 id="org2dc6bd9"><span class="section-number-3">1.12</span> 修改类</h3>
<div class="outline-text-3" id="text-1-12">
<pre class="example">
class String
  # 回文字符串返回 true
  def palindrome?
    self == self.reverse
  end
end
</pre>
</div>
</div>
</div>

<div id="outline-container-org049f2ff" class="outline-2">
<h2 id="org049f2ff"><span class="section-number-2">2</span> 伪变量</h2>
<div class="outline-text-2" id="text-2">
<p>
伪变量是特殊的变量，有着局部变量的外观，但行为却像常量。您不能给这些变量赋任何值。
</p>

<ul class="org-ul">
<li>self : 当前方法的接收器对象。</li>
<li>true : 代表 true 的值。</li>
<li>false: 代表 false 的值。</li>
<li>nil : 代表 undefined 的值。</li>
<li><b>FILE</b>: 当前源文件的名称。</li>
<li><b>LINE</b>: 当前行在源文件中的编号。</li>
</ul>
</div>
</div>

<div id="outline-container-orgfec6ae6" class="outline-2">
<h2 id="orgfec6ae6"><span class="section-number-2">3</span> 变量作用域</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>常量
：以大写字母开头。定义在类或模块内的常量可以从类或模块的内部访问，定义在类或模块外的常量可以被全局访问。常量不能定义在方法内。引用一个未初始化的常量会产生错误。对已经初始化的常量赋值会产生警告。在外部引用常量名需要使用
=::=。</li>
<li>全局变量：以 <code>$</code> 为前缀，对整个程序可见。未初始化的值为 <code>nil=，在使用
  =-w</code> 选项后，会产生警告。</li>
<li>类变量 ：以 <code>@@</code>
为前缀，仅对定义该类变量的类及其子类可见。必须初始化后才能在方法定义中使用。在使用
<code>-w</code> 选项后，重载类变量会产生警告。</li>
<li>实例变量：以 <code>@</code>
为前缀，对定义该变量的类的实例及其实例方法可见，但不可以直接被类使用。未初始化的值为
<code>nil=，在使用 =-w</code> 选项后，会产生警告。</li>
<li>局部变量：仅在局部代码块中可见，局部变量的作用域从
<code>class=、=module=、=def</code> 或 <code>do</code>
到相对应的结尾或者从左大括号到右大括号。当调用一个未初始化的局部变量时，它被解释为调用一个不带参数的方法。</li>
</ul>
</div>
</div>

<div id="outline-container-orgad0301e" class="outline-2">
<h2 id="orgad0301e"><span class="section-number-2">4</span> module and class</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>module
比较关注的是功能方面，它把方法收集在一起，组成一个特殊的上下文，通常表示一种能力，比如
Enumerable。</li>
<li>class
就是我们所理解的经典的类，它可以创建实例对象，包含实例变量和类变量，一般通过对象来与外界交流。</li>
</ol>

<p>
class 和 module 很相似，类只不过是增加强了 module，它比 module
多了三个方法：new()、allocate()和 superclass()。
</p>

<p>
class 扩展 module 时用的两种方法：include 和
extend，当然它们是有区别的。
</p>

<ul class="org-ul">
<li>include 包含一个 module 时，把它的实例方法和变量变成了 class
的实例方法和变量，这样类的祖先链中会出现这个 module。</li>
<li>extend 扩展一个 module 时，会把它的实例方法作为类方法加入到
class，并且祖先链里不会出现这个 module。</li>
<li>可以通过 <code>extend self</code>
的方式暴露本模块的实例方，多混合时慎用。还可以通过匿名形式
<code>extend Module.new { def hello; 'hello'; end}</code> 的形式处理，避免
<code>include</code> 后的污染。</li>
<li>module 中定义的静态方法只能通过模块名引用，通过 <code>extend self</code>
暴露的可以被类 =extend=、=include=。</li>
<li>通过 <code>extend=、=include</code> 引用的模块，不能嵌套引用。</li>
<li>通过 <code>extend</code> 引用的多个模块，数据独立，相互之间不能互通。</li>
<li>通过 <code>A::B</code> 的形式定义模块时，左边的 <code>A</code> 需要提前定义。</li>
</ul>

<p>
所有的类都继承自 object 类，object 类又继承 basicobject 类，basicobject
它是一个白板类。object 类是 ruby
类和对象默认的根类，它的方法在所有子类中可用，它包含了 kernel 内核。
</p>

<p>
class 通常都是逻辑完整的，甚至能在现实世界中找到对应物，而对 module
来说却很难是逻辑完整的，因为 module
只能描述一个特殊的上下文，而这个上下文通常无法组成一个完整的对象，需要被找一个宿主，而这个宿主有可能是
class，也有可能是 module。
</p>

<p>
需要用于做命名空间或用于 mixin 的时候用 module, 其他时候用 class。 当
class 中或多个 class 中有重复代码需要抽象出来时，可以使用 module。
</p>

<p>
更容易解耦，继承哪个类，只能选一个，但具体要 include 哪几个 module
可以根据不同需求选择不同的 module. 有了 autoload 更加能优化性能。
可以考虑先用 class 去写代码， 当多个 class 的代码逻辑相似的时候，
可以考虑用基类/继承来提取相似的逻辑。当继承无法实现提取的时候，
比如有时候，两个 class 代码逻辑相似， 但是，两个 class 的基类不同，而
ruby 又不支持多继承。 所以，这个时候， 就可以考虑使用 module
来实现，相似代码的提取。
</p>
</div>
</div>

<div id="outline-container-org617f7b3" class="outline-2">
<h2 id="org617f7b3"><span class="section-number-2">5</span> 单例 singleton</h2>
<div class="outline-text-2" id="text-5">
<p>
instance 方法定义在 Singleton
这个模块里，运行时将这个模块引入，类就可以访问 Singleton 中的 instance
方法。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7;">require</span> <span style="color: #2d9574;">'singleton'</span>
<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Logger</span>
  <span style="color: #4f97d7;">include</span> <span style="color: #ce537a; font-weight: bold;">Singleton</span>

<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3fafe29" class="outline-2">
<h2 id="org3fafe29"><span class="section-number-2">6</span> <code>self</code> 说明</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><code>self</code> 在 <code>class</code> 内, 代表当前类。</li>
<li><code>self</code> 在 <code>class &lt;&lt; self</code> 内,
代表当前类，此范围内定义为类方法和类变量。</li>
<li><code>self</code> 在 <code>def self.class_method</code> 内, 代表当前类。</li>
<li><code>self</code> 在 <code>def instance_method</code> 内, 代表当前类的实例。</li>
<li><code>extend self</code> 在 <code>module</code> 内, 模块方法不能直接调用，通过 <code>extend self</code>
让实例方法同时为类方法，可以直接使用模块方法，如果被 <code>include</code> 到
<code>class</code> 中，依然还是类的实例方法。</li>
</ul>
</div>

<div id="outline-container-orge3d23bb" class="outline-3">
<h3 id="orge3d23bb"><span class="section-number-3">6.1</span> <code>self</code> 和 <code>@</code> 使用区别</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>通过 <code>attr_accessor :val</code> 定义实例变量，会创建实例变量
<code>val=，并在构造函数中对它初始化，同时创建读方法 =val</code> 和写方法 <code>val=</code>
的变量访问器。外部可以直接通过实例对象的变量访问器来访问变量。在类的方法内访问可以使用
<code>@val</code> 访问，也可以使用 <code>self.val</code> 访问实例方法。</li>
<li>通过 <code>@</code>
定义实例变量，外部不能直接访问，只能通过定义的方法访问。在类的方法内访问需要加
<code>@</code> 符号。</li>
<li>类的实例变量不一定先要在构造函数中定义和初始化。
可以在类的任意方法中定义和使用，使用前也不需要初始化。</li>
</ul>
</div>
</div>

<div id="outline-container-org02fb320" class="outline-3">
<h3 id="org02fb320"><span class="section-number-3">6.2</span> 注意</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>左值不要省略 <code>self</code> 或 =@=。</li>
<li><code>self.</code>
前缀默认调用方法。没有前缀的同名的变量会以较高的优先级覆盖掉同名的方法，可以通过在方法调用时显式添加括号或者在调用方法前显式添加
<code>self</code> 作为方法接收对象。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org80609e8" class="outline-2">
<h2 id="org80609e8"><span class="section-number-2">7</span> 方法</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>方法后缀感叹号，表示会修改对象的值。</li>
</ul>
</div>
