_org/_posts/dev/2018-09-13-ruby.org
** 可变参数数组

所有不确定的参数都被作为数组赋值给变量 =args=，=*args=
这种形式的参数，只能在方法定义的参数列表中出现一次。

#+BEGIN_SRC ruby
    def foo(first, *args, last)
      [first, args, last]
    end

    p foo(1, 2, 3, 4, 5)   #=> [1, [2, 3, 4], 5]
#+END_SRC

** 符号散列参数

符号参数在 Ruby 2.0
中定义。可以使用符号将参数名与参数值成对地传给方法内部使用，设置默认值后不用关心参数个数和参数调用顺序。符号参数可以与普通参数搭配使用。

#+BEGIN_SRC ruby
    def foo(arg, x: 0, y: 1, z: 2)
      [arg, x, y, z]
    end
#+END_SRC

** 可变参数符号散列

可以使用 =options = {}= 的形式定义不确定的散列参数，但更推荐采用 Ruby
2.0 中定义的参数使用 =*变量名=
的形式，可以将参数列表以外的关键字参数以散列形式保存。

#+BEGIN_SRC ruby
    def foo(x: 0, y: 1, z: 2, *args)
      [x, y, z, args]
    end

    def bar(x: 0, y: 1, z: 2, options = {})
      [x, y, z, options]
    end

    foo(z: 11, y: 12, x: 13)                  #=> [13, 12, 11, {}]
    foo(z: 11, y: 12, x: 13, a: 1, b: 2)      #=> [13, 12, 11, {:a=>1, :b=>2}]
    bar(z: 11, y: 12, x: 13)                  #=> [13, 12, 11, {}]
    bar(z: 11, y: 12, x: 13, a: 1, b: 2)      #=> [13, 12, 11, {:a=>1, :b=>2}]
#+END_SRC

** 方法调用

** 数组分解为参数

调用方法是，如果以 =*数组=
的形式指定参数，这时传递给方法的不是数组本身，而是数组的各元素被按照顺序传递给方法。但需要注意的是，元素个数必须和方法定义的参数个数一致。

#+BEGIN_SRC ruby
    def foo(a, b, c)
      a + b + c
    end

    args = [2, 3]
    p foo(1, *agrs)   #=> 6
#+END_SRC

** 把散列作为参数传递

散列的字面量是 ={}=，将散列的字面量作为最后一个参数传递给方法时可以省略
={}=。可以表示一组散列参数或其他类型参数，和参数前面有 =*=
双星号定义的区别是定义不明确，可以接收任意参数，而双星号定义的参数明确为散列参数。

#+BEGIN_SRC ruby
    def foo(arg1, arg2)
      [arg1, arg2]
    end

    p foo(100, a: 1, b: 2)   #=> [100, {:a=>1, :b=>2}]
#+END_SRC

* Include、Extend、ClassMethods、Load、Require 的使用区别

** Include

当你 Include 一个模块到某个类时,
相当于把模块中定义的方法插入到类中。它允许使用 mixin。它用来 DRY
你的代码, 避免重复。例如, 当你有多个类时, 需要相同的函数时,
可以把函数定义到 module 中, 进行 include。 下例假设模块 Log 和类
TestClass 在相同的.rb 文件。如果它们存在于多个文件, 则需要使用 load 或
require 导入文件。

#+BEGIN_SRC ruby
    module Log
      def class_type
        "This class is of type: #{self.class}"
      end
    end

    class TestClass
      include Log
    end

    tc = TestClass.new.class_type
    puts tc #This class is of type: TestClass
#+END_SRC

