_posts/dev/2018-09-13-ruby.html

<div id="outline-container-org41efb8a" class="outline-3">
<h3 id="org41efb8a"><span class="section-number-3">7.1</span> 方法参数</h3>
</div>

<div id="outline-container-org4efc724" class="outline-3">
<h3 id="org4efc724"><span class="section-number-3">7.2</span> 可变参数数组</h3>
<div class="outline-text-3" id="text-7-2">
<p>
所有不确定的参数都被作为数组赋值给变量 <code>args=，=*args</code>
这种形式的参数，只能在方法定义的参数列表中出现一次。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">foo</span><span style="color: #4f97d7;">(</span>first, *args, last<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7;">[</span>first, args, last<span style="color: #4f97d7;">]</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #4f97d7;">p</span> foo<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>   <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [1, [2, 3, 4], 5]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org22d68c9" class="outline-3">
<h3 id="org22d68c9"><span class="section-number-3">7.3</span> 符号散列参数</h3>
<div class="outline-text-3" id="text-7-3">
<p>
符号参数在 Ruby 2.0
中定义。可以使用符号将参数名与参数值成对地传给方法内部使用，设置默认值后不用关心参数个数和参数调用顺序。符号参数可以与普通参数搭配使用。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">foo</span><span style="color: #4f97d7;">(</span>arg, <span style="color: #a45bad;">x:</span> <span style="color: #a45bad;">0</span>, <span style="color: #a45bad;">y:</span> <span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">z:</span> <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7;">[</span>arg, x, y, z<span style="color: #4f97d7;">]</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org139bc67" class="outline-3">
<h3 id="org139bc67"><span class="section-number-3">7.4</span> 可变参数符号散列</h3>
<div class="outline-text-3" id="text-7-4">
<p>
可以使用 <code>options = {}</code> 的形式定义不确定的散列参数，但更推荐采用 Ruby
2.0 中定义的参数使用 <code>*变量名</code>
的形式，可以将参数列表以外的关键字参数以散列形式保存。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">foo</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">x:</span> <span style="color: #a45bad;">0</span>, <span style="color: #a45bad;">y:</span> <span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">z:</span> <span style="color: #a45bad;">2</span>, *args<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7;">[</span>x, y, z, args<span style="color: #4f97d7;">]</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">bar</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">x:</span> <span style="color: #a45bad;">0</span>, <span style="color: #a45bad;">y:</span> <span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">z:</span> <span style="color: #a45bad;">2</span>, options = <span style="color: #bc6ec5;">{}</span><span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7;">[</span>x, y, z, options<span style="color: #4f97d7;">]</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

foo<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">z:</span> <span style="color: #a45bad;">11</span>, <span style="color: #a45bad;">y:</span> <span style="color: #a45bad;">12</span>, <span style="color: #a45bad;">x:</span> <span style="color: #a45bad;">13</span><span style="color: #4f97d7;">)</span>                  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [13, 12, 11, {}]</span>
foo<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">z:</span> <span style="color: #a45bad;">11</span>, <span style="color: #a45bad;">y:</span> <span style="color: #a45bad;">12</span>, <span style="color: #a45bad;">x:</span> <span style="color: #a45bad;">13</span>, <span style="color: #a45bad;">a:</span> <span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">b:</span> <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>      <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [13, 12, 11, {:a=&gt;1, :b=&gt;2}]</span>
bar<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">z:</span> <span style="color: #a45bad;">11</span>, <span style="color: #a45bad;">y:</span> <span style="color: #a45bad;">12</span>, <span style="color: #a45bad;">x:</span> <span style="color: #a45bad;">13</span><span style="color: #4f97d7;">)</span>                  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [13, 12, 11, {}]</span>
bar<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">z:</span> <span style="color: #a45bad;">11</span>, <span style="color: #a45bad;">y:</span> <span style="color: #a45bad;">12</span>, <span style="color: #a45bad;">x:</span> <span style="color: #a45bad;">13</span>, <span style="color: #a45bad;">a:</span> <span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">b:</span> <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>      <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [13, 12, 11, {:a=&gt;1, :b=&gt;2}]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org659fcd8" class="outline-3">
<h3 id="org659fcd8"><span class="section-number-3">7.5</span> 方法调用</h3>
</div>

<div id="outline-container-org5ec6a39" class="outline-3">
<h3 id="org5ec6a39"><span class="section-number-3">7.6</span> 数组分解为参数</h3>
<div class="outline-text-3" id="text-7-6">
<p>
调用方法是，如果以 <code>*数组</code>
的形式指定参数，这时传递给方法的不是数组本身，而是数组的各元素被按照顺序传递给方法。但需要注意的是，元素个数必须和方法定义的参数个数一致。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">foo</span><span style="color: #4f97d7;">(</span>a, b, c<span style="color: #4f97d7;">)</span>
  a + b + c
<span style="color: #4f97d7; font-weight: bold;">end</span>

args = <span style="color: #4f97d7;">[</span><span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span><span style="color: #4f97d7;">]</span>
<span style="color: #4f97d7;">p</span> foo<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span>, *agrs<span style="color: #4f97d7;">)</span>   <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; 6</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a6630c" class="outline-3">
<h3 id="org9a6630c"><span class="section-number-3">7.7</span> 把散列作为参数传递</h3>
<div class="outline-text-3" id="text-7-7">
<p>
散列的字面量是 <code>{}=，将散列的字面量作为最后一个参数传递给方法时可以省略
={}=。可以表示一组散列参数或其他类型参数，和参数前面有 =*</code>
双星号定义的区别是定义不明确，可以接收任意参数，而双星号定义的参数明确为散列参数。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">foo</span><span style="color: #4f97d7;">(</span>arg1, arg2<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7;">[</span>arg1, arg2<span style="color: #4f97d7;">]</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #4f97d7;">p</span> foo<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">100</span>, <span style="color: #a45bad;">a:</span> <span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">b:</span> <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>   <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [100, {:a=&gt;1, :b=&gt;2}]</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org15e344b" class="outline-2">
<h2 id="org15e344b"><span class="section-number-2">8</span> Include、Extend、ClassMethods、Load、Require 的使用区别</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orge90456e" class="outline-3">
<h3 id="orge90456e"><span class="section-number-3">8.1</span> Include</h3>
<div class="outline-text-3" id="text-8-1">
<p>
当你 Include 一个模块到某个类时,
相当于把模块中定义的方法插入到类中。它允许使用 mixin。它用来 DRY
你的代码, 避免重复。例如, 当你有多个类时, 需要相同的函数时,
可以把函数定义到 module 中, 进行 include。 下例假设模块 Log 和类
TestClass 在相同的.rb 文件。如果它们存在于多个文件, 则需要使用 load 或
require 导入文件。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">Log</span>
  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">class_type</span>
    <span style="color: #2d9574;">"This class is of type: </span><span style="color: #7590db;">#{self.class}</span><span style="color: #2d9574;">"</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">TestClass</span>
  <span style="color: #4f97d7;">include</span> <span style="color: #ce537a; font-weight: bold;">Log</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

tc = <span style="color: #ce537a; font-weight: bold;">TestClass</span>.new.class_type
<span style="color: #4f97d7;">puts</span> tc <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">This class is of type: TestClass</span>
</pre>
</div>
</div>
</div>
