_org/_posts/dev/2018-09-13-ruby.org
** Extend

当你使用 Extend 来替换 Include 的时候, 在类定义中使用的 extend Log
实际是一种简写，实际运行的是 self.extend(Log)。 并不是说使用 Extend
时就是类方法。而是需要注意到我们实际使用的是一种简写，由于是
self(即类本身) 调用了 Extend
这个方法，才使得添加模块中的方法被设定成了类方法。

所以如果希望避免这一误会，可以在类定义中使用 self.extend(module, ...)
而非 extend(module, ...)。

#+BEGIN_SRC ruby
    module Mod
        def hello
          "Hello from Mod.\n"
        end
    end

    class Klass
      def hello
        "Hello from Klass.\n"
      end
    end

    k = Klass.new
    k.hello         #=> "Hello from Klass.\n"
    k.extend(Mod)   #=> #<Klass:0x401b3bc8>
    k.hello         #=> "Hello from Mod.\n"
#+END_SRC

#+BEGIN_SRC ruby
    module Log
      def class_type
        "This class is of type: #{self.class}"
      end
    end

    class TestClass
      extend Log
      # ...
    end

    TestClass.new.class # => TestClass
    TestClass.class # => Class

    tc = TestClass.class_type
    puts tc  # => This class is of type: Class
#+END_SRC

当你在类中使用 Extend 来代替 Include, 如果你实例化 TestClass 并调用
class_type 方法时，你将会得到 NoMethodError。再一次强调, 使用 Extend
时方法是类方法。

** 混入时回调

- =append_features=在执行 =include= 或 =extend=
  语句时被调用，是真正的混入执行操作，不是回调方法，必须使用 =super=
  来执行混入操作，否则模块不会被混入。
- =included= 的方式在被 =include= 的时候回调。
- =extended= 的方式在被 =extend= 的时候回调。
- =append_features=在 =included= 之前操作。

#+BEGIN_SRC ruby
    module M
      def self.append_features(parent)
        puts "append_features: #{self} is included in #{parent}"
        super
      end

      def self.included(base)
        puts "#{self} is included in #{base}"
      end
    end
#+END_SRC

