_posts/dev/2018-09-13-ruby.html

<div id="outline-container-orge9c4d0a" class="outline-3">
<h3 id="orge9c4d0a"><span class="section-number-3">8.2</span> Extend</h3>
<div class="outline-text-3" id="text-8-2">
<p>
当你使用 Extend 来替换 Include 的时候, 在类定义中使用的 extend Log
实际是一种简写，实际运行的是 self.extend(Log)。 并不是说使用 Extend
时就是类方法。而是需要注意到我们实际使用的是一种简写，由于是
self(即类本身) 调用了 Extend
这个方法，才使得添加模块中的方法被设定成了类方法。
</p>

<p>
所以如果希望避免这一误会，可以在类定义中使用 self.extend(module, &#x2026;)
而非 extend(module, &#x2026;)。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">Mod</span>
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">hello</span>
      <span style="color: #2d9574;">"Hello from Mod.\n"</span>
    <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Klass</span>
  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">hello</span>
    <span style="color: #2d9574;">"Hello from Klass.\n"</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

k = <span style="color: #ce537a; font-weight: bold;">Klass</span>.new
k.hello         <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; "Hello from Klass.\n"</span>
k.extend<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Mod</span><span style="color: #4f97d7;">)</span>   <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; #&lt;Klass:0x401b3bc8&gt;</span>
k.hello         <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; "Hello from Mod.\n"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">Log</span>
  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">class_type</span>
    <span style="color: #2d9574;">"This class is of type: </span><span style="color: #7590db;">#{self.class}</span><span style="color: #2d9574;">"</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">TestClass</span>
  <span style="color: #4f97d7;">extend</span> <span style="color: #ce537a; font-weight: bold;">Log</span>
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">...</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #ce537a; font-weight: bold;">TestClass</span>.new.class <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; TestClass</span>
<span style="color: #ce537a; font-weight: bold;">TestClass</span>.class <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; Class</span>

tc = <span style="color: #ce537a; font-weight: bold;">TestClass</span>.class_type
<span style="color: #4f97d7;">puts</span> tc  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; This class is of type: Class</span>
</pre>
</div>

<p>
当你在类中使用 Extend 来代替 Include, 如果你实例化 TestClass 并调用
class_type 方法时，你将会得到 NoMethodError。再一次强调, 使用 Extend
时方法是类方法。
</p>
</div>
</div>

<div id="outline-container-orgc156522" class="outline-3">
<h3 id="orgc156522"><span class="section-number-3">8.3</span> 混入时回调</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li><code>append_features=在执行 =include</code> 或 <code>extend</code>
语句时被调用，是真正的混入执行操作，不是回调方法，必须使用 <code>super</code>
来执行混入操作，否则模块不会被混入。</li>
<li><code>included</code> 的方式在被 <code>include</code> 的时候回调。</li>
<li><code>extended</code> 的方式在被 <code>extend</code> 的时候回调。</li>
<li><code>append_features=在 =included</code> 之前操作。</li>
</ul>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">M</span>
  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #bc6ec5; font-weight: bold;">append_features</span><span style="color: #4f97d7;">(</span>parent<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7;">puts</span> <span style="color: #2d9574;">"append_features: </span><span style="color: #7590db;">#{self}</span><span style="color: #2d9574;"> is included in </span><span style="color: #7590db;">#{parent}</span><span style="color: #2d9574;">"</span>
    <span style="color: #4f97d7; font-weight: bold;">super</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>

  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #bc6ec5; font-weight: bold;">included</span><span style="color: #4f97d7;">(</span>base<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7;">puts</span> <span style="color: #2d9574;">"</span><span style="color: #7590db;">#{self}</span><span style="color: #2d9574;"> is included in </span><span style="color: #7590db;">#{base}</span><span style="color: #2d9574;">"</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
