_org/_posts/dev/2018-09-13-ruby.org
** ClassMethods

为了将代码更好的模块化，Ruby 的提供了不同类型的混入(include 和
extend)来实现混入类方法和实例方法。但是不管是类的类方法还是实例方法，最终都是模块的实例方法，因此，为了同时实现类方法和实例方法的混入，必须定义两个模块，然后分别
include 和 extend，如下：

#+BEGIN_SRC ruby
    module ClassMethods
    end
    module InstanceMethods
    end
    class Foo
        extend ClassMethods
        include InstanceMethods
    end
#+END_SRC

可能是觉得这种方法将模块的粒度分得太开(模块的划分粒度的确是个经常遇到问题)，因此在
Ruby 中出现了下面一种惯例，将类方法定义在一个子模块中，使用
included()回调，这个子模块常常命名为 ClassMethods。

#+BEGIN_SRC ruby
    module Mod
        def self.included(base)
            base.extend(ClassMothods)
        end
        module ClassMethods
            # 类方法定义
        end
        #实例方法定义
    end
    class Bar
        include Mod
    end
#+END_SRC

上面代码将实现了在 Mod 中同时定义类方法和实例方法。需要注意的是，即使在
ClassMethods 中定义的是类方法，也不能在方法前加
self，否者，该方法会成为模块方法，混入时会被自动忽略了。

当某个对象执行时 =include MyModule=，可以使用
=extend MyModule::ClassMethods=。如果你想要一个
=mixin=，它不仅可以为类的实例添加一些方法，而且可以添加到类本身。

#+BEGIN_SRC ruby
    module M
      def mul
        @x * @y
      end

      module ClassMethods
        def factory(x)
          new(x, 2*x)
        end
      end

      def self.included(base)
        base.extend ClassMethods
      end
    end

    class P
      include M

      def initialize(x, y)
        @x = x
        @y = y
      end

      def sum
        @x + @y
      end
    end

    p1 = P.new(5,15)
    puts "#{p1.sum} #{p1.mul}"
    # => 20 75

    p2=P.factory(10)
    puts "#{p2.sum} #{p2.mul}"
    # => 30 200

    p3=p2.factory(5)
    # => NoMethodError: undefined method `factory' for #<P:0x00007fc5f1fe6820 @x=10, @y=20>
#+END_SRC

可以使用 Rails 的 =ActiveSupport::Concern= 模块来便捷操作

- Concern 中定义的 self.extended()告诉我们，必须通过 extend 混入，而不是
  include；
- 声明类方法的模块的名字为 ClassMethods，如果拼写错误，会直接被忽略；
- Concern 类为每个通过 extend 混入它的类提供了一个 included 类方法(Class
  Macro)，可以传入一个块(Block)，从而实现回调。

#+BEGIN_SRC ruby
    require 'active_support/concern'

    module A
      extend ActiveSupport::Concern
      module ClassMethods
        def method_injected_by_a
          puts 'method_injected_by_a'
        end
      end
    end

    module B
      include A
      extend ActiveSupport::Concern
      included do
        puts 'include callback in B'
      end
    end

    class C
      include B
    end

    C.method_injected_by_a

    # => include callback in B
    # => method_injected_by_a
#+END_SRC

- 没有手动的为模块 A 定义 self.included(base)也实现了将 A::ClassMethods
  混入为 C 类的类方法，代码变干净了；
- 对于仍然有需要 includ 回调的需求，可以直接使用 ActiveSupport::Concern
  中定义的 included 方法来满足；
- 在模块 A 中定义的方法 method_injected_by_a()没有变成模块 B
  的模块方法，而仍然是 C 类的类方法，依赖问题也被解决了。

** Require

Require 方法允许你载入一个库并且会阻止你加载多次。当你使用 require
重复加载同一个 library 时，require 方法 将会返回
false。当你要载入的库在不同的文件时才能使用 require 方法。下例将演示
require 的使用方式。

文件 test_library.rb 和 test_require.rb 在同一个目录下。

#+BEGIN_SRC ruby
    # test_library.rb
    puts " load this libary "
#+END_SRC

#+BEGIN_SRC ruby
    # test_require.rb
    puts (require './test_library')
    puts (require './test_library')
    puts (require './test_library')

    # 结果为
    #  load this libary
    # true
    # false
    # false
#+END_SRC

