_posts/dev/2018-09-13-ruby.html

<div id="outline-container-org32ea553" class="outline-3">
<h3 id="org32ea553"><span class="section-number-3">8.4</span> ClassMethods</h3>
<div class="outline-text-3" id="text-8-4">
<p>
为了将代码更好的模块化，Ruby 的提供了不同类型的混入(include 和
extend)来实现混入类方法和实例方法。但是不管是类的类方法还是实例方法，最终都是模块的实例方法，因此，为了同时实现类方法和实例方法的混入，必须定义两个模块，然后分别
include 和 extend，如下：
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">ClassMethods</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">InstanceMethods</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Foo</span>
    <span style="color: #4f97d7;">extend</span> <span style="color: #ce537a; font-weight: bold;">ClassMethods</span>
    <span style="color: #4f97d7;">include</span> <span style="color: #ce537a; font-weight: bold;">InstanceMethods</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<p>
可能是觉得这种方法将模块的粒度分得太开(模块的划分粒度的确是个经常遇到问题)，因此在
Ruby 中出现了下面一种惯例，将类方法定义在一个子模块中，使用
included()回调，这个子模块常常命名为 ClassMethods。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">Mod</span>
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #bc6ec5; font-weight: bold;">included</span><span style="color: #4f97d7;">(</span>base<span style="color: #4f97d7;">)</span>
        base.extend<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">ClassMothods</span><span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">end</span>
    <span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">ClassMethods</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#31867;&#26041;&#27861;&#23450;&#20041;</span>
    <span style="color: #4f97d7; font-weight: bold;">end</span>
    <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#23454;&#20363;&#26041;&#27861;&#23450;&#20041;</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Bar</span>
    <span style="color: #4f97d7;">include</span> <span style="color: #ce537a; font-weight: bold;">Mod</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>
</pre>
</div>

<p>
上面代码将实现了在 Mod 中同时定义类方法和实例方法。需要注意的是，即使在
ClassMethods 中定义的是类方法，也不能在方法前加
self，否者，该方法会成为模块方法，混入时会被自动忽略了。
</p>

<p>
当某个对象执行时 =include MyModule=，可以使用
=extend MyModule::ClassMethods=。如果你想要一个
=mixin=，它不仅可以为类的实例添加一些方法，而且可以添加到类本身。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">M</span>
  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">mul</span>
    <span style="color: #7590db;">@x</span> * <span style="color: #7590db;">@y</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>

  <span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">ClassMethods</span>
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">factory</span><span style="color: #4f97d7;">(</span>x<span style="color: #4f97d7;">)</span>
      new<span style="color: #4f97d7;">(</span>x, <span style="color: #a45bad;">2</span>*x<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">end</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>

  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #bc6ec5; font-weight: bold;">included</span><span style="color: #4f97d7;">(</span>base<span style="color: #4f97d7;">)</span>
    base.extend <span style="color: #ce537a; font-weight: bold;">ClassMethods</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">P</span>
  <span style="color: #4f97d7;">include</span> <span style="color: #ce537a; font-weight: bold;">M</span>

  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">initialize</span><span style="color: #4f97d7;">(</span>x, y<span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">@x</span> = x
    <span style="color: #7590db;">@y</span> = y
  <span style="color: #4f97d7; font-weight: bold;">end</span>

  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">sum</span>
    <span style="color: #7590db;">@x</span> + <span style="color: #7590db;">@y</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

p1 = <span style="color: #ce537a; font-weight: bold;">P</span>.new<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">5</span>,<span style="color: #a45bad;">15</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">puts</span> <span style="color: #2d9574;">"</span><span style="color: #7590db;">#{p1.sum}</span><span style="color: #2d9574;"> </span><span style="color: #7590db;">#{p1.mul}</span><span style="color: #2d9574;">"</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; 20 75</span>

p2=<span style="color: #ce537a; font-weight: bold;">P</span>.factory<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">10</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">puts</span> <span style="color: #2d9574;">"</span><span style="color: #7590db;">#{p2.sum}</span><span style="color: #2d9574;"> </span><span style="color: #7590db;">#{p2.mul}</span><span style="color: #2d9574;">"</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; 30 200</span>

p3=p2.factory<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; NoMethodError: undefined method `factory' for #&lt;P:0x00007fc5f1fe6820 @x=10, @y=20&gt;</span>
</pre>
</div>

<p>
可以使用 Rails 的 <code>ActiveSupport::Concern</code> 模块来便捷操作
</p>

<ul class="org-ul">
<li>Concern 中定义的 self.extended()告诉我们，必须通过 extend 混入，而不是
include；</li>
<li>声明类方法的模块的名字为 ClassMethods，如果拼写错误，会直接被忽略；</li>
<li>Concern 类为每个通过 extend 混入它的类提供了一个 included 类方法(Class
Macro)，可以传入一个块(Block)，从而实现回调。</li>
</ul>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7;">require</span> <span style="color: #2d9574;">'active_support/concern'</span>

<span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">A</span>
  <span style="color: #4f97d7;">extend</span> <span style="color: #ce537a; font-weight: bold;">ActiveSupport</span>::<span style="color: #ce537a; font-weight: bold;">Concern</span>
  <span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">ClassMethods</span>
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">method_injected_by_a</span>
      <span style="color: #4f97d7;">puts</span> <span style="color: #2d9574;">'method_injected_by_a'</span>
    <span style="color: #4f97d7; font-weight: bold;">end</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">B</span>
  <span style="color: #4f97d7;">include</span> <span style="color: #ce537a; font-weight: bold;">A</span>
  <span style="color: #4f97d7;">extend</span> <span style="color: #ce537a; font-weight: bold;">ActiveSupport</span>::<span style="color: #ce537a; font-weight: bold;">Concern</span>
  included <span style="color: #4f97d7; font-weight: bold;">do</span>
    <span style="color: #4f97d7;">puts</span> <span style="color: #2d9574;">'include callback in B'</span>
  <span style="color: #4f97d7; font-weight: bold;">end</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">C</span>
  <span style="color: #4f97d7;">include</span> <span style="color: #ce537a; font-weight: bold;">B</span>
<span style="color: #4f97d7; font-weight: bold;">end</span>

<span style="color: #ce537a; font-weight: bold;">C</span>.method_injected_by_a

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; include callback in B</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; method_injected_by_a</span>
</pre>
</div>

<ul class="org-ul">
<li>没有手动的为模块 A 定义 self.included(base)也实现了将 A::ClassMethods
混入为 C 类的类方法，代码变干净了；</li>
<li>对于仍然有需要 includ 回调的需求，可以直接使用 ActiveSupport::Concern
中定义的 included 方法来满足；</li>
<li>在模块 A 中定义的方法 method_injected_by_a()没有变成模块 B
的模块方法，而仍然是 C 类的类方法，依赖问题也被解决了。</li>
</ul>
</div>
</div>

<div id="outline-container-org5ae6954" class="outline-3">
<h3 id="org5ae6954"><span class="section-number-3">8.5</span> Require</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Require 方法允许你载入一个库并且会阻止你加载多次。当你使用 require
重复加载同一个 library 时，require 方法 将会返回
false。当你要载入的库在不同的文件时才能使用 require 方法。下例将演示
require 的使用方式。
</p>

<p>
文件 test_library.rb 和 test_require.rb 在同一个目录下。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">test_library.rb</span>
<span style="color: #4f97d7;">puts</span> <span style="color: #2d9574;">" load this libary "</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">test_require.rb</span>
<span style="color: #4f97d7;">puts</span> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">require</span> <span style="color: #2d9574;">'./test_library'</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">puts</span> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">require</span> <span style="color: #2d9574;">'./test_library'</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">puts</span> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">require</span> <span style="color: #2d9574;">'./test_library'</span><span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#32467;&#26524;&#20026;</span>
<span style="color: #2aa1ae; background-color: #292e34;">#  </span><span style="color: #2aa1ae; background-color: #292e34;">load this libary</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">true</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">false</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">false</span>
</pre>
</div>
</div>
</div>
