_org/_posts/dev/2018-09-13-ruby.org
** Load

Load 方法基本和 require
方法功能一致，但它不会跟踪要导入的库是否已被加载。因此当重复使用 load
方法时，也会载入多次。大部分情况你都会使用 require 来代替
load。但当你需要每次都要加载时候你才会使用 load,
例如模块的状态会频繁地变化, 你会使用 load 进行加载，获取最新的状态。

#+BEGIN_SRC ruby
    puts load "./test_library.rb"  #在这里不能省略 .rb, require 可以省略
    puts load "./test_library.rb"
    puts load "./test_library.rb"

    #结果
    # load this libary
    #true
    # load this libary
    #true
    # load this libary
    #true
#+END_SRC

** 综述

- 模块方法 self.module 在混入的时候仍然被忽略。
- 使用 extend 混入时，模块中的方法成为类的类方法，而使用 include
  混入时，模块中的方法成为类的实例方法。
- 如果同时需要类方法和实例方法，可以使用 =include ClassMethods= 的方式。

* autoload

使用
autoload，只有使用到需要的常量或类文件才被加载。。我们真正需要用某个文件时才加载，而
require 是直接加载，不管你是否会用到。

#+BEGIN_SRC ruby
    autoload(:Bar, 'foo/bar')
#+END_SRC

* map(collect)、each、select、find(detect)、inject、reject

** map（别名函数 collect）

对数组中每个元素进行表达式操作，原始数组不会被改变，返回执行表达式结果的新数组

#+BEGIN_SRC ruby
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10].map{ |e| e * 3 }
    # => [3, 6, 9, 12, 15, 18, 21, 24, 27, 30]

    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10].collect{ |e| e == 3 }
    # =>[false, false, true, false, false, false, false, false, false, false]
#+END_SRC

** each

常用作数组的循环操作，对循环的参数做表达式操作，原数组不会被改变，返回原始数组

#+BEGIN_SRC ruby
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10].each{|e| print e.to_s + "###"}
    # => 1###2###3###4###5###6###7###8###9###10###=> [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
#+END_SRC

** select

相当于过滤器，返回符合表达式元素的新数组，如果所有都不符合表达式则返回空数组

#+BEGIN_SRC ruby
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10].select{ |e| e == 3 }
    # => [3]

    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10].select{ |e| e * 3 }
    # => [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
#+END_SRC

** find（别名函数 detect）

返回列表中第一个符合条件的元素

#+BEGIN_SRC ruby
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10].detect{ |e| e == 3 || e == 2 }
    # =>  2
#+END_SRC

** inject

在所声明的容器中注入符合条件的元素，通常为累加器作用

#+BEGIN_SRC ruby

    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10].inject{ |sum, e| sum += e }
    # 其中 sum 为所声明的注入器 将累加后的结果最后注入到 sum 中并返回注入器最后结果

    [1,2,3,4,5,6,7,8,9,10].inject{ |result, elem| result + elem}
    # => 55
    # 此时 inject 没有带参数，这是 result 会为数组中第一个元素，elem 为第二个元素，依次累加返回最后结果

    {1 => 'a', 2 => 'b', 3 =>'c'}.inject({}){ |key, value| value }
    # => [3, "c"]
#+END_SRC

** reject

去除列表中符合条件的元素

#+BEGIN_SRC ruby
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10].reject{ |e| e == 2 || e == 8 }
    # => [1, 3, 4, 5, 6, 7, 9, 10]
#+END_SRC

* 符号

** =*= 号的作用

星号有乘和取元素两种含义。

** 1. 有正常的算数功能

- 一个星号表示乘法。
- 两个星号表示指数计算。

#+BEGIN_SRC ruby
    3 * 3   #=> 9
    3 * 3  #=> 27
#+END_SRC

