_posts/dev/2018-09-13-ruby.html

<div id="outline-container-orga9836f1" class="outline-3">
<h3 id="orga9836f1"><span class="section-number-3">8.6</span> Load</h3>
<div class="outline-text-3" id="text-8-6">
<p>
Load 方法基本和 require
方法功能一致，但它不会跟踪要导入的库是否已被加载。因此当重复使用 load
方法时，也会载入多次。大部分情况你都会使用 require 来代替
load。但当你需要每次都要加载时候你才会使用 load,
例如模块的状态会频繁地变化, 你会使用 load 进行加载，获取最新的状态。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7;">puts</span> <span style="color: #4f97d7;">load</span> <span style="color: #2d9574;">"./test_library.rb"</span>  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#22312;&#36825;&#37324;&#19981;&#33021;&#30465;&#30053; .rb, require &#21487;&#20197;&#30465;&#30053;</span>
<span style="color: #4f97d7;">puts</span> <span style="color: #4f97d7;">load</span> <span style="color: #2d9574;">"./test_library.rb"</span>
<span style="color: #4f97d7;">puts</span> <span style="color: #4f97d7;">load</span> <span style="color: #2d9574;">"./test_library.rb"</span>

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#32467;&#26524;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">load this libary</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">true</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">load this libary</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">true</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">load this libary</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">true</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2583130" class="outline-3">
<h3 id="org2583130"><span class="section-number-3">8.7</span> 综述</h3>
<div class="outline-text-3" id="text-8-7">
<ul class="org-ul">
<li>模块方法 self.module 在混入的时候仍然被忽略。</li>
<li>使用 extend 混入时，模块中的方法成为类的类方法，而使用 include
混入时，模块中的方法成为类的实例方法。</li>
<li>如果同时需要类方法和实例方法，可以使用 <code>include ClassMethods</code> 的方式。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org783dc77" class="outline-2">
<h2 id="org783dc77"><span class="section-number-2">9</span> autoload</h2>
<div class="outline-text-2" id="text-9">
<p>
使用
autoload，只有使用到需要的常量或类文件才被加载。。我们真正需要用某个文件时才加载，而
require 是直接加载，不管你是否会用到。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7;">autoload</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">:Bar</span>, <span style="color: #2d9574;">'foo/bar'</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org08668e8" class="outline-2">
<h2 id="org08668e8"><span class="section-number-2">10</span> map(collect)、each、select、find(detect)、inject、reject</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org241dda4" class="outline-3">
<h3 id="org241dda4"><span class="section-number-3">10.1</span> map（别名函数 collect）</h3>
<div class="outline-text-3" id="text-10-1">
<p>
对数组中每个元素进行表达式操作，原始数组不会被改变，返回执行表达式结果的新数组
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">6</span>, <span style="color: #a45bad;">7</span>, <span style="color: #a45bad;">8</span>, <span style="color: #a45bad;">9</span>, <span style="color: #a45bad;">10</span><span style="color: #4f97d7;">]</span>.map<span style="color: #4f97d7;">{</span> |e| e * <span style="color: #a45bad;">3</span> <span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [3, 6, 9, 12, 15, 18, 21, 24, 27, 30]</span>

<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">6</span>, <span style="color: #a45bad;">7</span>, <span style="color: #a45bad;">8</span>, <span style="color: #a45bad;">9</span>, <span style="color: #a45bad;">10</span><span style="color: #4f97d7;">]</span>.collect<span style="color: #4f97d7;">{</span> |e| e == <span style="color: #a45bad;">3</span> <span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt;[false, false, true, false, false, false, false, false, false, false]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org65451fe" class="outline-3">
<h3 id="org65451fe"><span class="section-number-3">10.2</span> each</h3>
<div class="outline-text-3" id="text-10-2">
<p>
常用作数组的循环操作，对循环的参数做表达式操作，原数组不会被改变，返回原始数组
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">6</span>, <span style="color: #a45bad;">7</span>, <span style="color: #a45bad;">8</span>, <span style="color: #a45bad;">9</span>, <span style="color: #a45bad;">10</span><span style="color: #4f97d7;">]</span>.each<span style="color: #4f97d7;">{</span>|e| <span style="color: #4f97d7;">print</span> e.to_s + <span style="color: #2d9574;">"###"</span><span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; 1###2###3###4###5###6###7###8###9###10###=&gt; [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb8e0670" class="outline-3">
<h3 id="orgb8e0670"><span class="section-number-3">10.3</span> select</h3>
<div class="outline-text-3" id="text-10-3">
<p>
相当于过滤器，返回符合表达式元素的新数组，如果所有都不符合表达式则返回空数组
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">6</span>, <span style="color: #a45bad;">7</span>, <span style="color: #a45bad;">8</span>, <span style="color: #a45bad;">9</span>, <span style="color: #a45bad;">10</span><span style="color: #4f97d7;">]</span>.select<span style="color: #4f97d7;">{</span> |e| e == <span style="color: #a45bad;">3</span> <span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [3]</span>

<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">6</span>, <span style="color: #a45bad;">7</span>, <span style="color: #a45bad;">8</span>, <span style="color: #a45bad;">9</span>, <span style="color: #a45bad;">10</span><span style="color: #4f97d7;">]</span>.select<span style="color: #4f97d7;">{</span> |e| e * <span style="color: #a45bad;">3</span> <span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb2dae28" class="outline-3">
<h3 id="orgb2dae28"><span class="section-number-3">10.4</span> find（别名函数 detect）</h3>
<div class="outline-text-3" id="text-10-4">
<p>
返回列表中第一个符合条件的元素
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">6</span>, <span style="color: #a45bad;">7</span>, <span style="color: #a45bad;">8</span>, <span style="color: #a45bad;">9</span>, <span style="color: #a45bad;">10</span><span style="color: #4f97d7;">]</span>.detect<span style="color: #4f97d7;">{</span> |e| e == <span style="color: #a45bad;">3</span> || e == <span style="color: #a45bad;">2</span> <span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt;  2</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e6c178" class="outline-3">
<h3 id="org7e6c178"><span class="section-number-3">10.5</span> inject</h3>
<div class="outline-text-3" id="text-10-5">
<p>
在所声明的容器中注入符合条件的元素，通常为累加器作用
</p>

<div class="org-src-container">
<pre class="src src-ruby">
<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">6</span>, <span style="color: #a45bad;">7</span>, <span style="color: #a45bad;">8</span>, <span style="color: #a45bad;">9</span>, <span style="color: #a45bad;">10</span><span style="color: #4f97d7;">]</span>.inject<span style="color: #4f97d7;">{</span> |sum, e| sum += e <span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20854;&#20013; sum &#20026;&#25152;&#22768;&#26126;&#30340;&#27880;&#20837;&#22120; &#23558;&#32047;&#21152;&#21518;&#30340;&#32467;&#26524;&#26368;&#21518;&#27880;&#20837;&#21040; sum &#20013;&#24182;&#36820;&#22238;&#27880;&#20837;&#22120;&#26368;&#21518;&#32467;&#26524;</span>

<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span>,<span style="color: #a45bad;">3</span>,<span style="color: #a45bad;">4</span>,<span style="color: #a45bad;">5</span>,<span style="color: #a45bad;">6</span>,<span style="color: #a45bad;">7</span>,<span style="color: #a45bad;">8</span>,<span style="color: #a45bad;">9</span>,<span style="color: #a45bad;">10</span><span style="color: #4f97d7;">]</span>.inject<span style="color: #4f97d7;">{</span> |result, elem| result + elem<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; 55</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#27492;&#26102; inject &#27809;&#26377;&#24102;&#21442;&#25968;&#65292;&#36825;&#26159; result &#20250;&#20026;&#25968;&#32452;&#20013;&#31532;&#19968;&#20010;&#20803;&#32032;&#65292;elem &#20026;&#31532;&#20108;&#20010;&#20803;&#32032;&#65292;&#20381;&#27425;&#32047;&#21152;&#36820;&#22238;&#26368;&#21518;&#32467;&#26524;</span>

<span style="color: #4f97d7;">{</span><span style="color: #a45bad;">1</span> =&gt; <span style="color: #2d9574;">'a'</span>, <span style="color: #a45bad;">2</span> =&gt; <span style="color: #2d9574;">'b'</span>, <span style="color: #a45bad;">3</span> =&gt;<span style="color: #2d9574;">'c'</span><span style="color: #4f97d7;">}</span>.inject<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{}</span><span style="color: #4f97d7;">){</span> |key, value| value <span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [3, "c"]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf589d8" class="outline-3">
<h3 id="orgaf589d8"><span class="section-number-3">10.6</span> reject</h3>
<div class="outline-text-3" id="text-10-6">
<p>
去除列表中符合条件的元素
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">6</span>, <span style="color: #a45bad;">7</span>, <span style="color: #a45bad;">8</span>, <span style="color: #a45bad;">9</span>, <span style="color: #a45bad;">10</span><span style="color: #4f97d7;">]</span>.reject<span style="color: #4f97d7;">{</span> |e| e == <span style="color: #a45bad;">2</span> || e == <span style="color: #a45bad;">8</span> <span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [1, 3, 4, 5, 6, 7, 9, 10]</span>
</pre>
</div>
</div>
</div>
</div>
