_org/_posts/dev/2018-09-13-ruby.org
** 2. 数组 * integer

#+BEGIN_SRC ruby
    [1,2 ,[3 , [4 ,5]]] * 2 #=> [1,2 ,[3 , [4 ,5]] , 1,2 ,[3 , [4 ,5]]]
#+END_SRC

** 3. 字符串 * integer

#+BEGIN_SRC ruby
    "hello" * 2   #=> "hellohello"
#+END_SRC

** 4. 创建数组

#+BEGIN_SRC ruby
    *a = 1, 3, "as" #=> [1, 3, "as"]
#+END_SRC

** 5. 可变参数

一个星号表示数组元素迭代，在方法参数定义中可变参数数组。

#+BEGIN_SRC ruby
    def foo(*args)
      p args
    end

    a = [1 , 2]
    foo(1, 2)     #=> [1, 2]
    foo(*a)       #=> [1, 2]
    foo(a)        #=> [[1, 2]]
    foo([1, 2])   #=> [[1, 2]]
#+END_SRC

两个星号表示符号散列元素迭代，在方法参数定义中可变参数符号散列。

#+BEGIN_SRC ruby
    def foo(*args)
      p args
    end

    as = {a: 1, b: 2}
    foo(a: 1, b: 2)    #=> {a: 1, b: 2}
    foo({a: 1, b: 2})  #=> {a: 1, b: 2}
    foo(as)            #=> {a: 1, b: 2}
    foo(*as)          #=> {a: 1, b: 2}
#+END_SRC

注意，只能用于符号关键字散列，不能用于其他类型关键字散列。

#+BEGIN_SRC ruby
    h1 = {a: 'aa', b: 'bb'}
    h2 = {*h1, c: 'cc'}
    # => {a=>'aa', b=>'bb', c=>'cc'}
    h3 = {'a' => 'aa', 'b' => 'bb'}
    h4 = {*h3, 'c' => 'cc'}
    # => TypeError: wrong argument type String (expected Symbol)
#+END_SRC

** =#= 号的作用

=#= 号用来调用一个方法。

** =%= 号的作用

百分号表示法：

- %{String} 用于创建一个使用双引号括起来的字符串
- %Q{String} 用于创建一个使用双引号括起来的字符串
- %q{String} 用于创建一个使用单引号括起来的字符串
- %r{String} 用于创建一个正则表达式字面值
- %w{String}
  用于将一个字符串以空白字符切分成一个字符串数组，进行较少替换
- %W{String}
  用于将一个字符串以空白字符切分成一个字符串数组，进行较多替换
- %s{String} 用于生成一个符号对象
- %x{String} 用于执行 String 所代表的命令

字符串格式化：

- "%05d" % 123 » "00123"
- "%-5s: %08x" % [ "ID", self.id ] » "ID:200e1670"

** =+= 号的作用

=+=
号通常用于数值相加，和字符串连接，但用于字符串连接的时候需要注意，参与连接的字符串为空时会报异常，如果需要可以使用
=#{a}#{b}= 的形式连接字符串。

** ==>= 号的作用

==>= 是 Hash 字面量的键与值的分隔符。

#+BEGIN_SRC ruby
    h1 = {s: 'sss'}
    h2 = {:s => 'sss'}
    h3 = {'s' => 'sss'}
#+END_SRC

** =->= 号的作用

=->= 定义一个 lambda 字面量。

#+BEGIN_SRC ruby
    succ = ->(x){ x+1 }
    succ.call(2)
    # 上述代码与下列代码等同
    succ = lambda { |x| x + 1 }
    succ.call(2)
#+END_SRC

* Tips

** and or not 的优先级

=and or not= 的优先级较低，而 =&& || !=
的优先级是较高的，在使用中如果没有用括号严格界定的话，容易出问题，尤其是
=and return=语句，需要注意。

