_posts/dev/2018-09-13-ruby.html

<div id="outline-container-orgc29d098" class="outline-2">
<h2 id="orgc29d098"><span class="section-number-2">11</span> 符号</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org7a0e055" class="outline-3">
<h3 id="org7a0e055"><span class="section-number-3">11.1</span> <code>*</code> 号的作用</h3>
<div class="outline-text-3" id="text-11-1">
<p>
星号有乘和取元素两种含义。
</p>
</div>
</div>

<div id="outline-container-org623cdcb" class="outline-3">
<h3 id="org623cdcb"><span class="section-number-3">11.2</span> 1. 有正常的算数功能</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>一个星号表示乘法。</li>
<li>两个星号表示指数计算。</li>
</ul>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a45bad;">3</span> * <span style="color: #a45bad;">3</span>   <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; 9</span>
<span style="color: #a45bad;">3</span> * <span style="color: #a45bad;">3</span>  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; 27</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4bb41b5" class="outline-3">
<h3 id="org4bb41b5"><span class="section-number-3">11.3</span> 2. 数组 * integer</h3>
<div class="outline-text-3" id="text-11-3">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span> ,<span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">3</span> , <span style="color: #2d9574;">[</span><span style="color: #a45bad;">4</span> ,<span style="color: #a45bad;">5</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">]</span> * <span style="color: #a45bad;">2</span> <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [1,2 ,[3 , [4 ,5]] , 1,2 ,[3 , [4 ,5]]]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org99d8b66" class="outline-3">
<h3 id="org99d8b66"><span class="section-number-3">11.4</span> 3. 字符串 * integer</h3>
<div class="outline-text-3" id="text-11-4">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2d9574;">"hello"</span> * <span style="color: #a45bad;">2</span>   <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; "hellohello"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgffc165f" class="outline-3">
<h3 id="orgffc165f"><span class="section-number-3">11.5</span> 4. 创建数组</h3>
<div class="outline-text-3" id="text-11-5">
<div class="org-src-container">
<pre class="src src-ruby">*a = <span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">3</span>, <span style="color: #2d9574;">"as"</span> <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [1, 3, "as"]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3e1c53c" class="outline-3">
<h3 id="org3e1c53c"><span class="section-number-3">11.6</span> 5. 可变参数</h3>
<div class="outline-text-3" id="text-11-6">
<p>
一个星号表示数组元素迭代，在方法参数定义中可变参数数组。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">foo</span><span style="color: #4f97d7;">(</span>*args<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7;">p</span> args
<span style="color: #4f97d7; font-weight: bold;">end</span>

a = <span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span> , <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">]</span>
foo<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>     <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [1, 2]</span>
foo<span style="color: #4f97d7;">(</span>*a<span style="color: #4f97d7;">)</span>       <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [1, 2]</span>
foo<span style="color: #4f97d7;">(</span>a<span style="color: #4f97d7;">)</span>        <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [[1, 2]]</span>
foo<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>   <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [[1, 2]]</span>
</pre>
</div>

<p>
两个星号表示符号散列元素迭代，在方法参数定义中可变参数符号散列。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">foo</span><span style="color: #4f97d7;">(</span>*args<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7;">p</span> args
<span style="color: #4f97d7; font-weight: bold;">end</span>

as = <span style="color: #4f97d7;">{</span><span style="color: #a45bad;">a:</span> <span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">b:</span> <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">}</span>
foo<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">a:</span> <span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">b:</span> <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>    <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; {a: 1, b: 2}</span>
foo<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">a:</span> <span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">b:</span> <span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; {a: 1, b: 2}</span>
foo<span style="color: #4f97d7;">(</span>as<span style="color: #4f97d7;">)</span>            <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; {a: 1, b: 2}</span>
foo<span style="color: #4f97d7;">(</span>*as<span style="color: #4f97d7;">)</span>          <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; {a: 1, b: 2}</span>
</pre>
</div>

<p>
注意，只能用于符号关键字散列，不能用于其他类型关键字散列。
</p>

<div class="org-src-container">
<pre class="src src-ruby">h1 = <span style="color: #4f97d7;">{</span><span style="color: #a45bad;">a:</span> <span style="color: #2d9574;">'aa'</span>, <span style="color: #a45bad;">b:</span> <span style="color: #2d9574;">'bb'</span><span style="color: #4f97d7;">}</span>
h2 = <span style="color: #4f97d7;">{</span>*h1, <span style="color: #a45bad;">c:</span> <span style="color: #2d9574;">'cc'</span><span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; {a=&gt;'aa', b=&gt;'bb', c=&gt;'cc'}</span>
h3 = <span style="color: #4f97d7;">{</span><span style="color: #2d9574;">'a'</span> =&gt; <span style="color: #2d9574;">'aa'</span>, <span style="color: #2d9574;">'b'</span> =&gt; <span style="color: #2d9574;">'bb'</span><span style="color: #4f97d7;">}</span>
h4 = <span style="color: #4f97d7;">{</span>*h3, <span style="color: #2d9574;">'c'</span> =&gt; <span style="color: #2d9574;">'cc'</span><span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; TypeError: wrong argument type String (expected Symbol)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbdd9f2c" class="outline-3">
<h3 id="orgbdd9f2c"><span class="section-number-3">11.7</span> <code>#</code> 号的作用</h3>
<div class="outline-text-3" id="text-11-7">
<p>
<code>#</code> 号用来调用一个方法。
</p>
</div>
</div>

<div id="outline-container-orgf4a4fac" class="outline-3">
<h3 id="orgf4a4fac"><span class="section-number-3">11.8</span> <code>%</code> 号的作用</h3>
<div class="outline-text-3" id="text-11-8">
<p>
百分号表示法：
</p>

<ul class="org-ul">
<li>%{String} 用于创建一个使用双引号括起来的字符串</li>
<li>%Q{String} 用于创建一个使用双引号括起来的字符串</li>
<li>%q{String} 用于创建一个使用单引号括起来的字符串</li>
<li>%r{String} 用于创建一个正则表达式字面值</li>
<li>%w{String}
用于将一个字符串以空白字符切分成一个字符串数组，进行较少替换</li>
<li>%W{String}
用于将一个字符串以空白字符切分成一个字符串数组，进行较多替换</li>
<li>%s{String} 用于生成一个符号对象</li>
<li>%x{String} 用于执行 String 所代表的命令</li>
</ul>

<p>
字符串格式化：
</p>

<ul class="org-ul">
<li>"%05d" % 123 » "00123"</li>
<li>"%-5s: %08x" % [ "ID", self.id ] » "ID:200e1670"</li>
</ul>
</div>
</div>

<div id="outline-container-org3b86c4c" class="outline-3">
<h3 id="org3b86c4c"><span class="section-number-3">11.9</span> <code>+</code> 号的作用</h3>
<div class="outline-text-3" id="text-11-9">
<p>
<code>+</code>
号通常用于数值相加，和字符串连接，但用于字符串连接的时候需要注意，参与连接的字符串为空时会报异常，如果需要可以使用
<code>#{a}#{b}</code> 的形式连接字符串。
</p>
</div>
</div>

<div id="outline-container-orga349411" class="outline-3">
<h3 id="orga349411"><span class="section-number-3">11.10</span> <code>=&gt;</code> 号的作用</h3>
<div class="outline-text-3" id="text-11-10">
<p>
<code>=&gt;</code> 是 Hash 字面量的键与值的分隔符。
</p>

<div class="org-src-container">
<pre class="src src-ruby">h1 = <span style="color: #4f97d7;">{</span><span style="color: #a45bad;">s:</span> <span style="color: #2d9574;">'sss'</span><span style="color: #4f97d7;">}</span>
h2 = <span style="color: #4f97d7;">{</span><span style="color: #a45bad;">:s</span> =&gt; <span style="color: #2d9574;">'sss'</span><span style="color: #4f97d7;">}</span>
h3 = <span style="color: #4f97d7;">{</span><span style="color: #2d9574;">'s'</span> =&gt; <span style="color: #2d9574;">'sss'</span><span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org25057cb" class="outline-3">
<h3 id="org25057cb"><span class="section-number-3">11.11</span> <code>-&gt;</code> 号的作用</h3>
<div class="outline-text-3" id="text-11-11">
<p>
<code>-&gt;</code> 定义一个 lambda 字面量。
</p>

<div class="org-src-container">
<pre class="src src-ruby">succ = -&gt;<span style="color: #4f97d7;">(</span>x<span style="color: #4f97d7;">){</span> x+<span style="color: #a45bad;">1</span> <span style="color: #4f97d7;">}</span>
succ.call<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#19978;&#36848;&#20195;&#30721;&#19982;&#19979;&#21015;&#20195;&#30721;&#31561;&#21516;</span>
succ = <span style="color: #4f97d7;">lambda</span> <span style="color: #4f97d7;">{</span> |x| x + <span style="color: #a45bad;">1</span> <span style="color: #4f97d7;">}</span>
succ.call<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org51e06e4" class="outline-2">
<h2 id="org51e06e4"><span class="section-number-2">12</span> Tips</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org404e698" class="outline-3">
<h3 id="org404e698"><span class="section-number-3">12.1</span> and or not 的优先级</h3>
<div class="outline-text-3" id="text-12-1">
<p>
<code>and or not</code> 的优先级较低，而 <code>&amp;&amp; || !</code>
的优先级是较高的，在使用中如果没有用括号严格界定的话，容易出问题，尤其是
=and return=语句，需要注意。
</p>
</div>
</div>
