_org/_posts/dev/2018-09-13-ruby.org
** =$LOAD_PATH=

- =$LOAD_PATH= 和 =$:= 的含义是一样的，指的是 Ruby
  读取外部文件的一个环境变量。
- =$:.unshift= 增加路径。

#+BEGIN_SRC ruby
    # 装载库路径
    libdir = File.dirname(ENV['HOME'] + '/xhome/repo/app/rubykit/lib/my_kit.rb')
    $:.unshift(libdir) unless $:.include?(libdir) ||
                              $:.include?(File.expand_path(libdir))
#+END_SRC

** 类型判断

- is_a? 判断某个对象是否是某类或其子类的实例。
- kind_of? 是 is_a? 的别名。
- instance_of?
  与上述两个不同，只有当对象是一个明确的类的实例，而不是其子类时才返回
  true。

** ==== =eql?= =equal?= ===== 逻辑判断区别

- ==== ：比较两个对象的值是否相等。
- =eql?= ：比较两个对象的值和类型是否相等。
- =equal?=：比较两个对象是否为同一个对象。

上面三组符号的意义是逻辑比较，字符越长比较越严格。 而下面的 =====
的语意是基于包含、匹配的意思，常用于 =case= 语句。

===== 在通常情况下与 ==== 比较是一样的，但在某些特定情况下有特殊的含义：

- 值域 =Range= 中用于判断等号右值是否在左值的范围内。
- 正则表达式 =RegEx= 中用于判断右值是否为匹配左值。
- 类 =Class= 中用于判断右值是否为左值的实例，等同与 is_a? 方法。
- 符号=Symbol= 中用于判断右值是否与左值相同。

#+BEGIN_SRC ruby
    (1..10) === 5   # true: 5 属于 range 1..10
    /\d+/ === "123" # true: 字符串匹配这个模式
    String === "s"  # true: "s" 是一个字符串类的实例
    s = :s
    :s === s        # true
    :s === "s"      # false
    val = 17
    val.equal?(17)  # true
#+END_SRC

** 魔法注释 =# frozen_string_literal: true=

Ruby
中冻结的对象只会创建一次，以后遇到相同的对象会复用之前创建的对象，这样可以减少对象创建次数和垃圾回收次数。Ruby
中的符号、整数、浮点数默认都是冻结的，字符串字面量目前还不是。

为了提高程序性能，在 Ruby 3 中，字符串字面量在所有文件中默认被冻结。
为了过渡，Ruby2.3 增加了一个魔法注释：

#+BEGIN_SRC ruby
    # frozen_string_literal: true
#+END_SRC

把该注释加在文件的第一行。它告诉
Ruby，文件中的所有字符串字面量都被隐式冻结，不可修改，就像每一个字符串都调用了
freeze 方法一样。

#+BEGIN_SRC ruby
    # frozen_string_literal: true
    s = "string"
    puts s.frozen?      => true
    s << "12"           => can't modify frozen String (RuntimeError)
#+END_SRC

另外，在 Ruby 2.3 中使用 =--enable=frozen-string-literal 标=志运行
ruby，也会默认冻结所有文件中的字符串字面量。在单个文件中可以通过
=# frozen_string_literal: false= 覆盖全局设置（Ruby 3
中也可以用此方式覆盖全局设置）。

#+BEGIN_SRC sh
    ruby --enable=frozen-string-literal t.rb
#+END_SRC

如果想要修改字符串字面量怎么办？
无论全局或每个文件如何设置，可以使用一元+运算符（注意优先级）来产生非冻结字符串或调用
dup 方法来对其进行复制：

#+BEGIN_SRC ruby
    # frozen_string_literal: true
    "".frozen?
    # => true
    (+"").frozen?
    # => false
    "".dup.frozen?
    # => false
#+END_SRC

还可以使用一元-运算符冻结可变（未冻结）字符串。

#+BEGIN_SRC ruby
    (-"").frozen?
    # => true
#+END_SRC

* References

#+BEGIN_QUOTE
  本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。
  笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。

- https://ruby-china.org/topics/25706
- http://doudouclever.blog.163.com/blog/static/17511231020110743139240/
- https://ruby-china.org/topics/5096
- http://www.cnblogs.com/limx/p/5747523.html
#+END_QUOTE
