_posts/dev/2018-09-13-ruby.html

<div id="outline-container-org5ac978b" class="outline-3">
<h3 id="org5ac978b"><span class="section-number-3">12.2</span> <code>$LOAD_PATH</code></h3>
<div class="outline-text-3" id="text-12-2">
<ul class="org-ul">
<li><code>$LOAD_PATH</code> 和 <code>$:</code> 的含义是一样的，指的是 Ruby
读取外部文件的一个环境变量。</li>
<li><code>$:.unshift</code> 增加路径。</li>
</ul>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#35013;&#36733;&#24211;&#36335;&#24452;</span>
libdir = <span style="color: #ce537a; font-weight: bold;">File</span>.dirname<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">ENV</span><span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">'HOME'</span><span style="color: #bc6ec5;">]</span> + <span style="color: #2d9574;">'/xhome/repo/app/rubykit/lib/my_kit.rb'</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">$:</span>.unshift<span style="color: #4f97d7;">(</span>libdir<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">unless</span> <span style="color: #4f97d7;">$:</span>.include?<span style="color: #4f97d7;">(</span>libdir<span style="color: #4f97d7;">)</span> ||
                          <span style="color: #4f97d7;">$:</span>.include?<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">File</span>.expand_path<span style="color: #bc6ec5;">(</span>libdir<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6f56bb6" class="outline-3">
<h3 id="org6f56bb6"><span class="section-number-3">12.3</span> 类型判断</h3>
<div class="outline-text-3" id="text-12-3">
<ul class="org-ul">
<li>is_a? 判断某个对象是否是某类或其子类的实例。</li>
<li>kind_of? 是 is_a? 的别名。</li>
<li>instance_of?
与上述两个不同，只有当对象是一个明确的类的实例，而不是其子类时才返回
true。</li>
</ul>
</div>
</div>

<div id="outline-container-orgef3b2be" class="outline-3">
<h3 id="orgef3b2be"><span class="section-number-3">12.4</span> <code>==</code> <code>eql?</code> <code>equal?</code> <code>===</code> 逻辑判断区别</h3>
<div class="outline-text-3" id="text-12-4">
<ul class="org-ul">
<li><code>==</code> ：比较两个对象的值是否相等。</li>
<li><code>eql?</code> ：比较两个对象的值和类型是否相等。</li>
<li>=equal?=：比较两个对象是否为同一个对象。</li>
</ul>

<p>
上面三组符号的意义是逻辑比较，字符越长比较越严格。 而下面的 <code>===</code>
的语意是基于包含、匹配的意思，常用于 <code>case</code> 语句。
</p>

<p>
<code>===</code> 在通常情况下与 <code>==</code> 比较是一样的，但在某些特定情况下有特殊的含义：
</p>

<ul class="org-ul">
<li>值域 <code>Range</code> 中用于判断等号右值是否在左值的范围内。</li>
<li>正则表达式 <code>RegEx</code> 中用于判断右值是否为匹配左值。</li>
<li>类 <code>Class</code> 中用于判断右值是否为左值的实例，等同与 is_a? 方法。</li>
<li>符号=Symbol= 中用于判断右值是否与左值相同。</li>
</ul>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span>..<span style="color: #a45bad;">10</span><span style="color: #4f97d7;">)</span> === <span style="color: #a45bad;">5</span>   <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">true: 5 &#23646;&#20110; range 1..10</span>
<span style="color: #2d9574;">/\d+/</span> === <span style="color: #2d9574;">"123"</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">true: &#23383;&#31526;&#20018;&#21305;&#37197;&#36825;&#20010;&#27169;&#24335;</span>
<span style="color: #ce537a; font-weight: bold;">String</span> === <span style="color: #2d9574;">"s"</span>  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">true: "s" &#26159;&#19968;&#20010;&#23383;&#31526;&#20018;&#31867;&#30340;&#23454;&#20363;</span>
s = <span style="color: #a45bad;">:s</span>
<span style="color: #a45bad;">:s</span> === s        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">true</span>
<span style="color: #a45bad;">:s</span> === <span style="color: #2d9574;">"s"</span>      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">false</span>
val = <span style="color: #a45bad;">17</span>
val.equal?<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">17</span><span style="color: #4f97d7;">)</span>  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">true</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org23c7243" class="outline-3">
<h3 id="org23c7243"><span class="section-number-3">12.5</span> 魔法注释 <code># frozen_string_literal: true</code></h3>
<div class="outline-text-3" id="text-12-5">
<p>
Ruby
中冻结的对象只会创建一次，以后遇到相同的对象会复用之前创建的对象，这样可以减少对象创建次数和垃圾回收次数。Ruby
中的符号、整数、浮点数默认都是冻结的，字符串字面量目前还不是。
</p>

<p>
为了提高程序性能，在 Ruby 3 中，字符串字面量在所有文件中默认被冻结。
为了过渡，Ruby2.3 增加了一个魔法注释：
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">frozen_string_literal: true</span>
</pre>
</div>

<p>
把该注释加在文件的第一行。它告诉
Ruby，文件中的所有字符串字面量都被隐式冻结，不可修改，就像每一个字符串都调用了
freeze 方法一样。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">frozen_string_literal: true</span>
s = <span style="color: #2d9574;">"string"</span>
<span style="color: #4f97d7;">puts</span> s.frozen?      =&gt; <span style="color: #a45bad;">true</span>
s &lt;&lt; <span style="color: #2d9574;">"12"</span>           =&gt; can<span style="color: #2d9574;">'t modify frozen String (RuntimeError)</span>
</pre>
</div>

<p>
另外，在 Ruby 2.3 中使用 =&#x2013;enable=frozen-string-literal 标=志运行
ruby，也会默认冻结所有文件中的字符串字面量。在单个文件中可以通过
<code># frozen_string_literal: false</code> 覆盖全局设置（Ruby 3
中也可以用此方式覆盖全局设置）。
</p>

<div class="org-src-container">
<pre class="src src-sh">ruby --enable=frozen-string-literal t.rb
</pre>
</div>

<p>
如果想要修改字符串字面量怎么办？
无论全局或每个文件如何设置，可以使用一元+运算符（注意优先级）来产生非冻结字符串或调用
dup 方法来对其进行复制：
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">frozen_string_literal: true</span>
<span style="color: #2d9574;">""</span>.frozen?
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; true</span>
<span style="color: #4f97d7;">(</span>+<span style="color: #2d9574;">""</span><span style="color: #4f97d7;">)</span>.frozen?
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; false</span>
<span style="color: #2d9574;">""</span>.dup.frozen?
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; false</span>
</pre>
</div>

<p>
还可以使用一元-运算符冻结可变（未冻结）字符串。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #4f97d7;">(</span>-<span style="color: #2d9574;">""</span><span style="color: #4f97d7;">)</span>.frozen?
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; true</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd9a7be6" class="outline-2">
<h2 id="orgd9a7be6"><span class="section-number-2">13</span> References</h2>
<div class="outline-text-2" id="text-13">
<blockquote>
<p>
本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。
笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。
</p>

<ul class="org-ul">
<li><a href="https://ruby-china.org/topics/25706">https://ruby-china.org/topics/25706</a></li>
<li><a href="http://doudouclever.blog.163.com/blog/static/17511231020110743139240/">http://doudouclever.blog.163.com/blog/static/17511231020110743139240/</a></li>
<li><a href="https://ruby-china.org/topics/5096">https://ruby-china.org/topics/5096</a></li>
<li><a href="http://www.cnblogs.com/limx/p/5747523.html">http://www.cnblogs.com/limx/p/5747523.html</a></li>
</ul>
</blockquote>
</div>
</div>
